
from collections import defaultdict

begin_city = 'Рига'
end_city = 'Одесса'

graph = defaultdict(list)

# to end_city
paths_straight = {
    'Вильнюс': 987,
    'Брест': 806,
    'Витебск': 970,
    'Воронеж': 851,
    'Волгоград': 1063,
    'Ниж.Новгород': 1428,
    'Даугавпилс': 1085,
    'Калининград': 1166,
    'Каунас': 1054,
    'Киев': 444,
    'Житомир': 446,
    'Донецк': 561,
    'Кишинев': 154,
    'С.Петербург': 1495,
    'Рига': 1250,
    'Москва': 1138,
    'Казань': 1639,
    'Минск': 856,
    'Мурманск': 2504,
    'Орел': 816,
    'Таллин': 1493,
    'Харьков': 562,
    'Симферополь': 312,
    'Ярославль': 1388,
    'Уфа': 1987,
    'Самара': 1575,
    'Одесса': 0
}

node_names = []
node_index = {}

graph_positions = {
    'Вильнюс': (-0.7238504, -0.48628459),
    'Брест': (-0.85312486,  0.20022967),
    'Витебск': (-0.04787358, -0.30685642),
    'Даугавпилс': (-0.96189756, -0.52644417),
    'Калининград': (-0.89053281,  0.04480232),
    'Каунас': (0.78788298, -0.46653157),
    'Киев': (-0.80879633,  0.3981719),
    'Воронеж': (-0.38302139, -0.72861961),
    'Волгоград': (0.47150082, -0.71322021),
    'Ниж.Новгород': (0.97375763, -0.17565423),
    'С.Петербург': (-0.19762204,  0.22729796),
    'Орел': (-0.49602582,  0.69698236),
    'Ярославль': (-0.16210752,  0.45899196),
    'Житомир': (0.16889305, -1.),
    'Москва': (0.25416525, 0.5843606),
    'Рига': (0.38029175, -0.22261214),
    'Кишинев': (0.5741983 , 0.79525811),
    'Одесса': (-0.99662793, 0.35217424),
    'Харьков': (-0.65279244, -0.16650488),
    'Донецк': (-0.00554095, -0.01172692),
    'Мурманск': (-0.4218314 ,  0.23354718),
    'Таллин': (-0.13174759, -0.80471306),
    'Казань': (0.79177658, 0.44019641),
    'Минск': (-0.30442598,  0.86724701),
    'Уфа': (0.99922729, 0.57691201),
    'Симферополь': (-0.48027813, -0.22214897),
    'Самара': (0.88205169, 0.81613125)
}


